# Задача 18: Требуется найти в массиве A[1..N] самый близкий по величине элемент к заданному числу X.
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
# В последующих строках записаны N целых чисел Ai. Последняя строка содержит число X

# пример
# 5
# 1 2 3 4 5
# 6
# -> 5

N = abs(int(input('Введите количество элементов списка: ')))
Mas = input("Введите через пробел элементы списка: ").split()
Num = list(map(int, Mas))
if len(Num) != N or N == 0:
    print('Введенные элементы не соответствуют заявленному количеству!')
else:
    X = int(input('Введите число, с которым необходимо сравнивать элементы списка: '))
    min = abs(X - Num[0])
    index = 0
    for i in range(1, N):
        count = abs(X - Num[i])
        if count < min:
            min = count
            index = i
    print(f'Число {Num[index]} в заданном списке наиболее близко по величине к числу {X}, а их разница составляет {abs(X - Num[index])}')