# Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N].
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. 
# В последующих строках записаны N целых чисел Ai. Последняя строка содержит число X

# пример
# 5
# 1 2 3 4 5
# 3
# -> 1

N = abs(int(input('Введите количество элементов в списке: ')))
Mas = input("Введите через пробел элементы списка: ").split()
Num = list(map(int, Mas))
if len(Num) != N:
    print('Введенные элементы не соответствуют заявленному количеству!')
else:
    X = int(input('Введите число, которое необходимо найти в списке: '))
    count = 0
    for i in range(N):
        if Num[i] == X:
            count += 1
    print(f'Число {X} в заданном списке встречается {count} раз')